## Kuklina Polina

______________

In [1]:
import numpy as np
import pandas as pd

# 1 lesson

# Lesson topic: Знакомство с объектами библиотеки Pandas
# Pandas

### Домашнее задание

### Задача 1: Создать Series из наипиевского массива без индекса.

В этом случае индекс не передается, поэтому по умолчанию индексом будет range(n), где n — длина массива.

data = np.array(['a', 'b', 'c', 'd', 'e'])

In [2]:
data = np.array(['a', 'b', 'c', 'd', 'e'])
pd.Series(data, range(len(data)))

0    a
1    b
2    c
3    d
4    e
dtype: object

### Задача 2: Создать Series из словаря.

Передан список индексов большей длины, чем количество ключей, присутствующих в словаре. 

В этом случае порядок индекса сохраняется, а отсутствующий элемент заполняется значением NaN (не число). 

dictionary = {'A': 50, 'B': 10, 'C': 80}

index=['B', 'C', 'D', 'A']

In [3]:
dictionary = {'A': 50, 'B': 10, 'C': 80}
index = ['B', 'C', 'D', 'A']
pd.Series(dictionary, index)

B    10.0
C    80.0
D     NaN
A    50.0
dtype: float64

### Задача 3: Создайть Series из списка с использованием 'index'аргумента.

[10, 20, 30, 40, 50], 

index = ['a', 'b', 'c', 'd', 'e']

In [4]:
list_ = [10, 20, 30, 40, 50]
index = ['a', 'b', 'c', 'd', 'e']
pd.Series(list_, index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

### Задача 4: Создайть из 2-х словарей 2 объекта Series, а из них создайте один объект Dataframe.

dict1 = {'California': 100,

                   'Texas': 200,
                   
                   'New York': 300,
                   
                   'Florida': 400,
                   
                   'Illinois': 500}

dict2 = {'California': 'aaa', 'Texas': 'bbb', 'New York': 'ccc', 'Florida': 'ddd', 'Illinois': 'eee'}

In [5]:
dict1 = {'California': 100,
         'Texas': 200,
         'New York': 300,
         'Florida': 400,
         'Illinois': 500}
dict2 = {'California': 'aaa', 'Texas': 'bbb', 'New York': 'ccc', 'Florida': 'ddd', 'Illinois': 'eee'}
df1 = pd.Series(dict1)
df2 = pd.Series(dict2)
pd.DataFrame({'numbers': df1, 'letters': df2})

            numbers letters
California      100     aaa
Texas           200     bbb
New York        300     ccc
Florida         400     ddd
Illinois        500     eee

### Задача 5: Создать Index на основе списка 

list('abc')

In [6]:
pd.Index(list("abc"))

Index(['a', 'b', 'c'], dtype='object')

### Задача 6: Создать Pandas Dataframe из 2D-списка.

lst = [['Сейчас', 25], ['я', 30], 
       
    ['изучаю', 26], ['Pandas', 22]]

In [7]:
lst = [['Сейчас', 25], ['я', 30],
       ['изучаю', 26], ['Pandas', 22]] 
pd.DataFrame(lst)

        0   1
0  Сейчас  25
1       я  30
2  изучаю  26
3  Pandas  22

# 2 lesson

# Lesson topic: Индексация и выборка данных

### Домашнее задание

### Задача 1: Дана Series. Выбрать из нее определённое значение, используя метод .loc() и метод iloc.()

x = pd.Series([10, 20, 30, 40, 50], index =['a', 'b', 'c', 'd', 'e']) 

Выберите из Series значение 30, используя метод .loc() и метод iloc.()

In [8]:
x = pd.Series([10, 20, 30, 40, 50], index =['a', 'b', 'c', 'd', 'e'])
x.loc["c"]
x.iloc[2]

np.int64(30)

### Задача 2: Дан DataFrame. 

### Выбрать из него вторую и третью строки, используя метод .loc() и/или метод iloc.()

### Выбрать из него второй столбец, используя метод .loc() и/или метод iloc.()

### Выбрать из него значение 'bbb', используя метод .loc() и/или метод iloc.()

data = pd.DataFrame({'area': [1,2,3,4,5], 'pop': ['aaa', 'bbb', 'ccc', 'ddd', 'eee']})

In [9]:
data = pd.DataFrame({'area': [1,2,3,4,5], 'pop': ['aaa', 'bbb', 'ccc', 'ddd', 'eee']})
data.loc[1:2]
data.iloc[1:3]

   area  pop
1     2  bbb
2     3  ccc

In [10]:
data.loc[:, "pop"]
data.iloc[:, 1]

0    aaa
1    bbb
2    ccc
3    ddd
4    eee
Name: pop, dtype: object

In [11]:
data.loc[1, "pop"]
data.iloc[1, 1]

'bbb'

### Задача 3: Транспонируйте DataFrame

data = pd.DataFrame({'column_1': [35,21,39,54,59], 'column_2': [3000, [1,2,3], 'Hello', True, 47.39]})

In [12]:
data = pd.DataFrame({'column_1': [35,21,39,54,59], 'column_2': [3000, [1,2,3], 'Hello', True, 47.39]})
data.iloc[::-1, ::-1]

    column_2  column_1
4      47.39        59
3       True        54
2      Hello        39
1  [1, 2, 3]        21
0       3000        35

# 3 lesson

# Lesson topic: Операции над данными в библиотеке Pandas

### Домашнее задание

### Задача 1: Заданы два DataFrame. Выполните сложение этих 2-х DataFrame


##### «Seed» используется для инициализации внутреннего генератора псевдослучайных чисел. 
##### А предоставление фиксированного seed гарантирует, что одна и та же серия вызовов методов 'RandomState' 
#####  всегда будет давать одни и те же результаты, что может быть полезно при тестировании.
rng = np.random.RandomState(42)

ABC = pd.DataFrame(rng.randint(0, 10, (3, 3)), 
                 columns=list('ABC'))

df = pd.DataFrame(rng.randint(0, 20, (4, 4)), columns=['A', 'B', 'C', 'D'])

In [13]:
rng = np.random.RandomState(42)
ABC = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('ABC'))
df = pd.DataFrame(rng.randint(0, 20, (4, 4)), columns=['A', 'B', 'C', 'D'])
ABC + df

      A     B     C   D
0   9.0  10.0   9.0 NaN
1  15.0  11.0  10.0 NaN
2  13.0  17.0  23.0 NaN
3   NaN   NaN   NaN NaN

### Задача 2: Дан DataFrame df. Получите df[2]. 

### Найдите разность df - df.loc[2], выполнив эту операцию по строкам, указав ключевое слово axis 

rng = np.random.RandomState(42)

df = pd.DataFrame(rng.randint(0, 20, (4, 4)), columns=['A', 'B', 'C', 'D'])

In [14]:
rng = np.random.RandomState(42)
df = pd.DataFrame(rng.randint(0, 20, (4, 4)), columns=['A', 'B', 'C', 'D'])
df.subtract(df.loc[2], axis=1)

   A   B   C  D
0 -4  16   7  8
1 -3   3  11  8
2  0   0   0  0
3 -9   8  -2 -1

### Задача 3: Дан DataFrame df. Получите df[C]. 

### Найдите сумму df + df[C], выполнив эту операцию по столбцам, указав ключевое слово axis 
##### «Seed» используется для инициализации внутреннего генератора псевдослучайных чисел. 
##### А предоставление фиксированного seed гарантирует, что одна и та же серия вызовов методов 'RandomState' 
#####  всегда будет давать одни и те же результаты, что может быть полезно при тестировании.
rng = np.random.RandomState(42)

df = pd.DataFrame(rng.randint(0, 20, (4, 4)), columns=['A', 'B', 'C', 'D'])

In [15]:
rng = np.random.RandomState(42)
df = pd.DataFrame(rng.randint(0, 20, (4, 4)), columns=['A', 'B', 'C', 'D'])
df.subtract(df["C"], axis=0)

    A   B  C  D
0  -8   5  0 -4
1 -11 -12  0 -8
2   3  -4  0 -5
3  -4   6  0 -4

# 4 lesson

# Lesson topic: Обработка отсутствующих данных

### Домашнее задание

### Задача 1: Создайте DataFrame из 2-х Series. Выявите пустые значения в этом DataFrame, используя методы:

### df.isnull()

### df.notnull()

### df[df.notnull()]

data_a = pd.Series({'AAA': None, 
                  
                  'FFF': 111,
                  
                  'NNN': 222}, 
                 
                  name='DATA_A')

data_b = pd.Series({'AAA': 333, 
                    
                    'FFF': np.nan,
                    
                    'NNN': 777}, 
                    
                    name='population')

In [16]:
data_a = pd.Series({'AAA': None,
                    'FFF': 111,
                    'NNN': 222}, 
                   name='DATA_A')
data_b = pd.Series({'AAA': 333,
                    'FFF': np.nan,
                    'NNN': 777}, 
                   name='population')
df = pd.DataFrame({data_a.name: data_a, data_b.name: data_b})
df.isnull()
df.notnull()
df[df.notnull()]

     DATA_A  population
AAA     NaN       333.0
FFF   111.0         NaN
NNN   222.0       777.0

### Задача 2: Создайте DataFrame из 2-х Series. Удалите строки (столбцы) в этом DataFrame, используя методы:

### df.dropna()

data_a = pd.Series({'AAA': None, 
                  
                  'FFF': 111,
                  
                  'NNN': 222}, 
                   
                   name='DATA_A')

data_b = pd.Series({'AAA': 333, 
                    
                    'FFF': np.nan,
                        
                    'NNN': 777}, 
                    
                    name='DATA_B')

In [17]:
data_a = pd.Series({'AAA': None,
                    'FFF': 111,
                    'NNN': 222}, 
                   name='DATA_A')
data_b = pd.Series({'AAA': 333,
                    'FFF': np.nan,
                    'NNN': 777}, 
                   name='DATA_B')
df = pd.DataFrame({data_a.name: data_a, data_b.name: data_b})
df.dropna(axis=0)

     DATA_A  DATA_B
NNN   222.0   777.0

In [18]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [AAA, FFF, NNN]

### Задача 3: Создайте DataFrame из 2-х Series. Заполните пропуски в этом DataFrame средним значением в столбце (строке), используя метод:

### df.fillna()

data_a = pd.Series({'AAA': 1, 
                  
                  'FFF': None,
                  
                  'NNN': 3}, 
                   
                   name='DATA_A')

data_b = pd.Series({'AAA': 4, 
                    
                    'FFF': 5,
                        
                    'NNN': np.nan}, 
                    
                    name='DATA_B')

In [19]:
data_a = pd.Series({'AAA': 1,
                    'FFF': None,
                    'NNN': 3}, 
                   name='DATA_A')
data_b = pd.Series({'AAA': 4,
                    'FFF': 5,
                    'NNN': np.nan}, 
                   name='DATA_B')
df = pd.DataFrame({data_a.name: data_a, data_b.name: data_b})
df.fillna(df.mean(axis=0))

     DATA_A  DATA_B
AAA     1.0     4.0
FFF     2.0     5.0
NNN     3.0     4.5

In [20]:
df.fillna(df.mean(axis=1))

     DATA_A  DATA_B
AAA     1.0     4.0
FFF     NaN     5.0
NNN     3.0     NaN

# 5 lesson

# Lesson topic: Иерархическая индексация

### Домашнее задание

### Задача 1: Cформируйте объект MultiIndex из простого списка массивов, задающих значения индекса в каждом из уровней:

[['SPb', 'SPb', 'SPb', 'Moscow', 'Moscow', 'Moscow'], [10, 20, 30, 10, 20, 30]]

In [21]:
 pd.MultiIndex.from_arrays([['SPb', 'SPb', 'SPb', 'Moscow', 'Moscow', 'Moscow'], [10, 20, 30, 10, 20, 30]])

MultiIndex([(   'SPb', 10),
            (   'SPb', 20),
            (   'SPb', 30),
            ('Moscow', 10),
            ('Moscow', 20),
            ('Moscow', 30)],
           )

### Задача 2: Cформируйте объект MultiIndex из списка кортежей:

[('SPb', 10), ('SPb', 20), ('Moscow', 10), ('Moscow', 20), ('Kazan', 10), ('Kazan', 20)]

In [22]:
 pd.MultiIndex.from_tuples([('SPb', 10), ('SPb', 20), ('Moscow', 10), ('Moscow', 20), ('Kazan', 10), ('Kazan', 20)])

MultiIndex([(   'SPb', 10),
            (   'SPb', 20),
            ('Moscow', 10),
            ('Moscow', 20),
            ( 'Kazan', 10),
            ( 'Kazan', 20)],
           )

### Задача 3: Cформируйте объект MultiIndex из декартова произведения обычных индексов:

[['SPb', 'Moscow', 'Kazan'], [1000, 2000, 3000]]

In [23]:
pd.MultiIndex.from_product([['SPb', 'Moscow', 'Kazan'], [1000, 2000, 3000]])

MultiIndex([(   'SPb', 1000),
            (   'SPb', 2000),
            (   'SPb', 3000),
            ('Moscow', 1000),
            ('Moscow', 2000),
            ('Moscow', 3000),
            ( 'Kazan', 1000),
            ( 'Kazan', 2000),
            ( 'Kazan', 3000)],
           )

# 6 lesson

# Lesson topic: Иерархическая индексация. Индексация и срезы по мультииндексу

### Домашнее задание

### Задача 1: Создайте Series под названием realization, используя index и sales:

index = [('aaa', 1), 
         ('aaa', 2),
         ('bbb', 1), 
         ('bbb', 2),
         ('ccc', 1), 
         ('ccc', 2)]

sales = [1000, 1500, 2000, 1200, 2100, 1700]

### Сделайте выборку данных на основе булевой маски: realization > 1500

In [24]:
index = [('aaa', 1), ('aaa', 2), ('bbb', 1), ('bbb', 2), ('ccc', 1), ('ccc', 2)]
sales = [1000, 1500, 2000, 1200, 2100, 1700]
index = pd.MultiIndex.from_tuples(index)
realization = pd.Series(sales, index=index)
realization[realization > 1500]

bbb  1    2000
ccc  1    2100
     2    1700
dtype: int64

### Задача 2: Coздайте объект DataFrame c Мультииндексацией, используя index, columns и data:

##### Иерархические индексы и столбцы
index = pd.MultiIndex.from_product([['Store_1', 'Store_2'], ['1st quarter', '2st quarter']], 
                                   
                                   names=['year', 'visit'])

columns = pd.MultiIndex.from_product([['Mr. Smith', 'Mrs. Watson', 'Mr. Goodwin'], 
                                      
                                    ['stocks', 'salesи']],
names=['manager', 'type'])

##### Создаем имитационные данные
data = np.round(np.random.randn(4, 6), 1)

In [25]:
index = pd.MultiIndex.from_product([['Store_1', 'Store_2'], ['1st quarter', '2st quarter']],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Mr. Smith', 'Mrs. Watson', 'Mr. Goodwin'],
                                      ['stocks', 'sales']],
                                     names=['manager', 'type'])
data = np.round(np.random.randn(4, 6), 1)

df = pd.DataFrame(data, index=index, columns=columns)
df

manager             Mr. Smith       Mrs. Watson       Mr. Goodwin
type                   stocks sales      stocks sales      stocks sales
year    visit
Store_1 1st quarter      -1.4  -1.3        -0.2  -0.6        -1.2  -0.2
        2st quarter      -0.0   0.4        -0.3  -0.7        -0.3  -0.5
Store_2 1st quarter       0.2   0.0        -0.6  -0.3         0.8  -1.7
        2st quarter       1.1   0.5        -0.3  -0.0         1.2   0.6

### Задача 3: Создав DataFrame в Задаче 2, вычислите среднее значение по столбцам.

In [26]:
df.mean(axis=1)

year     visit
Store_1  1st quarter   -0.816667
         2st quarter   -0.233333
Store_2  1st quarter   -0.266667
         2st quarter    0.516667
dtype: float64

# 7 lesson

# Lesson topic: Объединение наборов данных: конкатенация и добавление в конец

### Домашнее задание

### Задача 1: выполните конкатенацию 2-х Series:

ser1 = pd.Series(['SPb', 'Mos', 'Kaz'], index=[1, 2, 3])

ser2 = pd.Series(['Nov', 'Ekat', 'Vlad'], index=[4, 5, 6])

In [27]:
ser1 = pd.Series(['SPb', 'Mos', 'Kaz'], index=[1, 2, 3])
ser2 = pd.Series(['Nov', 'Ekat', 'Vlad'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1     SPb
2     Mos
3     Kaz
4     Nov
5    Ekat
6    Vlad
dtype: object

### Задача 2: выполните конкатенацию 2-х DataFrame по столбцам:

list1, list2, list3 = [1, 2], [3, 4], [5, 6]

df1 = pd.DataFrame({'A': list1, 'B': list2, 'C': list3})

list4, list5, list6 = [10, 20], [30, 40], [50, 60]

df2 = pd.DataFrame({'A': list1, 'B': list2, 'C': list3})

In [28]:
list1, list2, list3 = [1, 2], [3, 4], [5, 6]
df1 = pd.DataFrame({'A': list1, 'B': list2, 'C': list3})
list4, list5, list6 = [10, 20], [30, 40], [50, 60]
df2 = pd.DataFrame({'A': list1, 'B': list2, 'C': list3})

pd.concat([df1, df2], axis=1)

   A  B  C  A  B  C
0  1  3  5  1  3  5
1  2  4  6  2  4  6

### Задача 3: выполните конкатенацию 2-х DataFrame по строкам с помощью опции join='inner':

list1, list2, list3 = [1, 2], [3, 4], [5, 6]

df1 = pd.DataFrame({'A': list1, 'B': list2, 'C': list3})

list4, list5, list6 = [10, 20], [30, 40], [50, 60]

df2 = pd.DataFrame({'B': list1, 'C': list2, 'D': list3})

In [29]:
list1, list2, list3 = [1, 2], [3, 4], [5, 6]
df1 = pd.DataFrame({'A': list1, 'B': list2, 'C': list3})
list4, list5, list6 = [10, 20], [30, 40], [50, 60]
df2 = pd.DataFrame({'B': list1, 'C': list2, 'D': list3})
pd.concat([df1, df2], join='inner')

   B  C
0  3  5
1  4  6
0  1  3
1  2  4

# 8 lesson

# Lesson topic: Объединение наборов данных: слияние и соединение

### Домашнее задание

### Задача 1: ### Задача 1: Выполните слияние 2-х DataFrame, используя функцию pd.merge(), метод df1.merge(df2):

zoo = pd.DataFrame([['elephant',1001, 500], ['elephant',1002, 600],['tiger',1003, 300], ['tiger',1004, 320], ['tiger',1005, 290],
                         
                         ['zebra',1006, 200], ['zebra',1007, 210], ['zebra',1008, 150], ['zebra',1009, 180], ['zebra',1010, 190],
                         
                         ['lion',1011, 420], ['lion',1012, 510], ['lion',1013, 530], ['lion',1014, 600],
                         
                         ['kangaroo',1015, 410], ['kangaroo',1016, 490]], columns=['animal', 'uniq_id', 'water_need'])

zoo_eats = pd.DataFrame([['elephant','vegetables'], ['tiger','meat'], 
                        
                        ['kangaroo','vegetables'], ['zebra','vegetables'], 
                        
                        ['giraffe','vegetables']], columns=['animal', 'food'])

In [30]:
zoo = pd.DataFrame([['elephant',1001, 500], ['elephant',1002, 600],['tiger',1003, 300], ['tiger',1004, 320], ['tiger',1005, 290],
                     ['zebra',1006, 200], ['zebra',1007, 210], ['zebra',1008, 150], ['zebra',1009, 180], ['zebra',1010, 190],
                     ['lion',1011, 420], ['lion',1012, 510], ['lion',1013, 530], ['lion',1014, 600],
                     ['kangaroo',1015, 410], ['kangaroo',1016, 490]], columns=['animal', 'uniq_id', 'water_need'])
zoo_eats = pd.DataFrame([['elephant','vegetables'], ['tiger','meat'],
                    ['kangaroo','vegetables'], ['zebra','vegetables'], 
                    ['giraffe','vegetables']], columns=['animal', 'food'])

pd.merge(zoo, zoo_eats)

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2      tiger     1003         300        meat
3      tiger     1004         320        meat
4      tiger     1005         290        meat
5      zebra     1006         200  vegetables
6      zebra     1007         210  vegetables
7      zebra     1008         150  vegetables
8      zebra     1009         180  vegetables
9      zebra     1010         190  vegetables
10  kangaroo     1015         410  vegetables
11  kangaroo     1016         490  vegetables

### Задача 2: Выполните слияние 2-х DataFrame, используя функцию pd.merge(), метод df1.merge(df2), 

### при помощи ключевого слова on

In [31]:
pd.merge(zoo, zoo_eats, on='animal')

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2      tiger     1003         300        meat
3      tiger     1004         320        meat
4      tiger     1005         290        meat
5      zebra     1006         200  vegetables
6      zebra     1007         210  vegetables
7      zebra     1008         150  vegetables
8      zebra     1009         180  vegetables
9      zebra     1010         190  vegetables
10  kangaroo     1015         410  vegetables
11  kangaroo     1016         490  vegetables

### Задача 3: Выполните слияние 2-х DataFrame, используя функцию pd.merge(), метод df1.merge(df2), 

### используя ключевое слово how='right'

In [32]:
pd.merge(zoo, zoo_eats, how='right')

      animal  uniq_id  water_need        food
0   elephant   1001.0       500.0  vegetables
1   elephant   1002.0       600.0  vegetables
2      tiger   1003.0       300.0        meat
3      tiger   1004.0       320.0        meat
4      tiger   1005.0       290.0        meat
5   kangaroo   1015.0       410.0  vegetables
6   kangaroo   1016.0       490.0  vegetables
7      zebra   1006.0       200.0  vegetables
8      zebra   1007.0       210.0  vegetables
9      zebra   1008.0       150.0  vegetables
10     zebra   1009.0       180.0  vegetables
11     zebra   1010.0       190.0  vegetables
12   giraffe      NaN         NaN  vegetables

# 9 lesson

# Lesson topic: Агрегирование и группировка

### Домашнее задание

### Задача 1: Дан DataFrame df.

### Выполните groupby по 'Maths', после этого выполните aggregate по списку ['min', np.median, max].

### Выполните groupby по 'Maths', после этого выполните aggregate по словарю {'Maths': 'min', 'Science': 'max'}.

df = pd.DataFrame([[3, 4, 5, 2], 
                   
                   [4, 3, 4, 5], 
                   
                   [5, 2, 5, 4]], 
                   
                   columns=['Maths',  'English',  
                           
                           'Science', 'History'])

In [33]:
df = pd.DataFrame([[3, 4, 5, 2],
                    [4, 3, 4, 5], 
                   [5, 2, 5, 4]], 
                  columns=['Maths',  'English',
                           'Science', 'History']) 
df.groupby('Maths').aggregate(["min", np.median, "max"])

C:\Tempos\ipykernel_20964\2906112076.py:6: FutureWarning: The provided callable <function median at 0x00000190943AA660> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('Maths').aggregate(["min", np.median, "max"])

      English            Science            History
          min median max     min median max     min median max
Maths
3           4    4.0   4       5    5.0   5       2    2.0   2
4           3    3.0   3       4    4.0   4       5    5.0   5
5           2    2.0   2       5    5.0   5       4    4.0   4

In [34]:
df.groupby('Maths').aggregate({'Maths': 'min',
                               'Science': 'max'})

       Maths  Science
Maths
3          3        5
4          4        4
5          5        5

### Задача 2: Дан словать data. Создайте из него DataFrame.

### После этого выполните groupby по "City". После этого выполните фильтрацию по условию x["City"] == "SPb".

data = {
    
    "Student_Name": ["Ivan", "Petr", "Valentina", "Masha", "Kirill"],
    
    "City": ["Moscow", "SPb", "Moscow", "Kazan", "Kazan"],
    
    "Biology": [3, 4, 5, 4, 5],
    
    "Chemistry": [4, 5, 3, 5, 4],

}

In [35]:
data = {"Student_Name": ["Ivan", "Petr", "Valentina", "Masha", "Kirill"],
        "City": ["Moscow", "SPb", "Moscow", "Kazan", "Kazan"],
        "Biology": [3, 4, 5, 4, 5],
        "Chemistry": [4, 5, 3, 5, 4]}

df = pd.DataFrame(data)

df.groupby("City").filter(lambda x: x["City"].iloc[0] == "SPb")

  Student_Name City  Biology  Chemistry
1         Petr  SPb        4          5

### Задача 3: Дан словать data. Создайте из него DataFrame.

### После этого выполните groupby по "City". После этого выполните фильтрацию по условию x["Biology"] == 5

data = {

    
    "Student_Name": ["Ivan", "Petr", "Valentina", "Masha", "Kirill"],
    
    "City": ["Moscow", "SPb", "Moscow", "Kazan", "Kazan"],
    
    "Biology": [3, 4, 5, 4, 5],
    
    "Chemistry": [4, 5, 3, 5, 4],

}

In [36]:
data = {"Student_Name": ["Ivan", "Petr", "Valentina", "Masha", "Kirill"],
        "City": ["Moscow", "SPb", "Moscow", "Kazan", "Kazan"],
        "Biology": [3, 4, 5, 4, 5],
        "Chemistry": [4, 5, 3, 5, 4]}

df = pd.DataFrame(data) 
df[df["Biology"] == 5]
# df.groupby("City").filter(lambda x: (x["Biology"] == 5).any())

  Student_Name    City  Biology  Chemistry
2    Valentina  Moscow        5          3
4       Kirill   Kazan        5          4

# 11 lesson

# Lesson topic: Векторизованные операции над строками

### Домашнее задание

### Задача 1: Создайте объект Series из списка list.

list = ['foo', 'fuz', np.nan]

### Если слово в созданной Series начинается с символа 'f', замените этот символ на строку 'ba'.

In [37]:
list_ = ['foof', 'fuz', np.nan]
data = pd.Series(list_)
pd.Series(list_).str.replace(r'^f', 'ba', regex=True)

0    baoof
1     bauz
2      NaN
dtype: object

### Задача 2: Создайте объект Series из списка list.

list = ['Lion', 'Monkey', 'Rabbit']

### Поиск слова по шаблону: если слово в созданной Series 'Monkey', выведите его.

### Другие слова не должны выводиться.

In [38]:
list_ = ['Lion', 'Monkey', 'Rabbit']
data = pd.Series(list_)
data.str.findall("Monkey")

0          []
1    [Monkey]
2          []
dtype: object

### Задача 3: Создайте объект Series из списка list.

list = ['Иван Петров', 
        
        'Светлана Пушкина', 
        
        'василий Сидоров',
        
        'Татьяна ларина', 
        
        'Фёдор Онегин', 
        
        'сергей кукушкин']

### Выведите на экран список всех фамилий людей из списка (первая буква фамилии должна быть заглавная).

### Выведите на экран список всех имён людей из списка (первая буква имени должна быть заглавная).

In [39]:
list_ = ['Иван Петров',
        'Светлана Пушкина', 
        'василий Сидоров',
        'Татьяна ларина', 
        'Фёдор Онегин', 
        'сергей кукушкин']

pd.Series(list_).str.split().str[-1].str.capitalize()

0      Петров
1     Пушкина
2     Сидоров
3      Ларина
4      Онегин
5    Кукушкин
dtype: object

In [40]:
pd.Series(list_).str.split().str[0].str.capitalize()

0        Иван
1    Светлана
2     Василий
3     Татьяна
4       Фёдор
5      Сергей
dtype: object